# FabricSheetMajorNumberOfWires Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..FabricSheetMajorNumberOfWires Property
ParameterTypeId Class See Also
---
"Major Number of Wires": Major Number of Wires
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId FabricSheetMajorNumberOfWires { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FabricSheetMajorNumberOfWires As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ FabricSheetMajorNumberOfWires {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace